Tekla Open API Reference for Tekla Structures 2025
BoltArray Methods
The BoltArray type exposes the following members.
Methods
Name | Description
AddBoltDistX
 Adds an X distance to the bolt array.
AddBoltDistY
 Adds a Y distance to the bolt array.
AddOtherPartToBolt
 Adds the given part to the list of the other parts that should be bolted.
 (Inherited from BoltGroup.)
CompareTo
 Compares Identifiers of model objects.
 (Inherited from ModelObject.)
Delete
 Deletes the bolt array instance with the given ID from the model database.
 (Overrides ModelObject.Delete().)
Equals
 Check if Identifiers of model objects are same.
 (Inherited from ModelObject.)
GetAllReportProperties
 Retrieves all properties for the model object in one hashtable. Type for the returned value must be checked using type casting.
 (Inherited from ModelObject.)
GetAllUserProperties
 Retrieves all properties for the model object in one hashtable. Type for the returned value must be checked using type casting.
 (Inherited from ModelObject.)
GetBoltDistX
 Returns the X distance defined by the argument.
GetBoltDistXCount
 Returns the amount of X distances in the bolt array.
GetBoltDistY
 Returns the Y distance defined by the argument.
GetBoltDistYCount
 Returns the amount of Y distances in the bolt array.
GetChildren
 Returns an enumerator of all the children model objects.
 (Inherited from ModelObject.)
GetCoordinateSystem
 Returns the coordinate system for the given model object.
 (Inherited from ModelObject.)
GetCustomObjectType
 Gets custom object type name from an existing object.
 (Inherited from ModelObject.)
GetDoubleReportProperties
 Retrieves multiple double report properties for the model object. It is faster to fetch multiple properties at once.
 (Inherited from ModelObject.)
GetDoubleUserProperties
 Retrieves all double properties for the model object.
 (Inherited from ModelObject.)
GetDynamicStringProperty
 Gets a dynamic string property from the model object.
 (Inherited from ModelObject.)
GetFatherComponent
 Returns the father component of the model object.
 (Inherited from ModelObject.)
GetFatherPour
 Returns the pour that the bolt group is associated to.
 (Inherited from BoltGroup.)
GetFatherPourUnit
 Returns the pour unit that the bolt group is associated to.
 (Inherited from BoltGroup.)
GetHierarchicObjects
 Returns an enumerator of all the connected hierarchic objects.
 (Inherited from ModelObject.)
GetIntegerReportProperties
 Retrieves multiple integer report properties for the model object. It is faster to fetch multiple properties at once.
 (Inherited from ModelObject.)
GetIntegerUserProperties
 Retrieves all integer properties for the model object.
 (Inherited from ModelObject.)
GetOtherPartsToBolt
 Returns an array list containing all the other parts that are bolted.
 (Inherited from BoltGroup.)
GetPhase
 Retrieves the phase of the model object (the phase number, the phase name, the phase comment and whether the phase is the current one or not).
 (Inherited from ModelObject.)
GetReportProperty(String, Double)
 Retrieves a double property of the report for the model object.
 (Inherited from ModelObject.)
GetReportProperty(String, Int32)
 Retrieves an integer property of the report for the model object.
 (Inherited from ModelObject.)
GetReportProperty(String, String)
 Retrieves a string property of the report for the model object.
 (Inherited from ModelObject.)
GetSolid()
 Method for getting the solid information of the bolt group.
 (Inherited from BoltGroup.)
GetSolid(Boolean)
 Method for getting the solid information of the bolt group.
 (Inherited from BoltGroup.)
GetStringReportProperties
 Retrieves multiple string report properties for the model object. It is faster to fetch multiple properties at once.
 (Inherited from ModelObject.)
GetStringUserProperties
 Retrieves all string properties for the model object.
 (Inherited from ModelObject.)
GetUserProperty(String, Double)
 Retrieves a double property for the model object.
 (Inherited from ModelObject.)
GetUserProperty(String, Int32)
 Retrieves an integer property for the model object.
 (Inherited from ModelObject.)
GetUserProperty(String, String)
 Retrieves a string property for the model object.
 (Inherited from ModelObject.)
Insert
 Inserts the bolt array into the model database.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the existing bolt array in the model database to match the current one.
Note, the IDs of Part To Bolt To, Part To Be Bolted and OtherParts cannot be modified.
 (Overrides ModelObject.Modify().)
RemoveBoltDistX
 Removes an X distance from the bolt array in the index position.
RemoveBoltDistY
 Removes a Y distance from the bolt array in the index position.
RemoveOtherPartToBolt
 Removes the given part from the list of the other bolted parts.
 (Inherited from BoltGroup.)
Select
 Selects a bolt array from the model database. The ID must be set.
 (Overrides ModelObject.Select().)
SetBoltDistX
 Sets the X distance at the index defined by the argument.
SetBoltDistY
 Sets the Y distance at the index defined by the argument.
SetCustomObjectType
 Sets a custom object type name for an existing object.
 (Inherited from ModelObject.)
SetDynamicStringProperty
 Sets a dynamic string property for the model object.
 (Inherited from ModelObject.)
SetLabel
 Sets a label for an object when a new instance is created, this method must be called before Insert. The label is used in plug-ins for identifying the changed object in modification.
 (Inherited from ModelObject.)
SetPhase
 Sets the phase of the model object.
 (Inherited from ModelObject.)
SetUserProperties
 Sets multiple properties for the model object.
 (Inherited from ModelObject.)
SetUserProperty(String, Double)
 Sets a double property for the model object.
 (Inherited from ModelObject.)
SetUserProperty(String, Int32)
 Sets an integer property for the model object.
 (Inherited from ModelObject.)
SetUserProperty(String, String)
 Sets a string property for the model object.
 (Inherited from ModelObject.)
Top
See Also
Reference
BoltArray Class
Tekla.Structures.Model Namespace